{"id":285,"text":"30\nEach college has a website\nEach college is structured into departments, each of which brings together specific teachers. Among these teachers, one of them is responsible for the department.\nA teacher is defined by his surname, first name, phone, email, date of taking office and his index.\nEach teacher teaches only one subject.\nStudents take several subjects and receive a mark for each of them.\nFor each student, we want to manage his name, first name, phone, email, as well as his year of entry to college.\nA subject can be taught by several teachers but always takes place in the same classroom (each having a specific number of places).\nWe want to be able to calculate the average by subject as well as by department\nWe also want to calculate the general average of a student and be able to display the subjects in which he has not been noted\nFinally, we must be able to print the data sheet (, first name, phone, email) of a teacher or a student.","label":[[8,16,"entity"],[16,20,"relationship"],[22,29,"attr"],[35,43,"entity"],[46,57,"relationship"],[62,73,"entity"],[89,96,"relationship"],[114,122,"entity"],[136,144,"entity"],[161,173,"relationship"],[181,191,"entity"],[195,203,"entity"],[206,214,"relationship"],[221,228,"attr"],[230,240,"attr"],[242,247,"attr"],[249,254,"attr"],[256,260,"attr"],[286,291,"attr"],[298,306,"entity"],[306,314,"relationship"],[323,330,"entity"],[332,341,"entity"],[341,346,"relationship"],[354,363,"entity"],[409,416,"entity"],[440,444,"attr"],[446,456,"attr"],[458,463,"attr"],[465,470,"attr"],[487,492,"attr"],[515,523,"entity"],[530,537,"relationship"],[548,557,"entity"],[592,602,"entity"],[626,633,"attr"]]}
{"id":286,"text":"2\nConsider the following sentences:\n\nA directory contains files\nA room contains walls\nModems and keyboards are input\/output devices\nA stock transaction is a purchase or a sale\nA bank account can belong to a natural or legal person","label":[[39,49,"entity"],[49,58,"relationship"],[58,63,"entity"],[66,71,"entity"],[71,80,"relationship"],[80,85,"entity"],[86,93,"entity"],[97,107,"entity"],[107,111,"relationship"],[124,131,"entity"],[140,152,"entity"],[152,155,"relationship"],[157,166,"entity"],[171,175,"entity"],[183,191,"entity"],[195,202,"relationship"],[207,215,"entity"],[218,224,"entity"]]}
{"id":287,"text":"20\nEither in a school that performs the following functions:\nDevelop catalogs that describe the courses and give the estimated dates of the sessions.\nRegister people who wish to participate in the sessions and send them their invitation.\nDetermine the trainers who will lead the sessions. Some sessions may be led by individual contractors.\nSome courses are organized into sectors. The courses use referenced documents.","label":[[96,104,"entity"],[140,148,"entity"],[159,166,"entity"],[178,190,"relationship"],[197,206,"entity"],[252,261,"entity"],[270,275,"relationship"],[279,287,"entity"],[294,303,"entity"],[310,314,"relationship"],[328,339,"entity"],[346,354,"entity"],[358,368,"relationship"],[373,380,"entity"],[386,394,"entity"],[394,398,"relationship"],[409,418,"entity"]]}
{"id":288,"text":"37\nA person is characterized by his name, his first name, his sex and his age. The objects of the Person class must be able to calculate their income and expenses. The attributes of the class are private; the name, the first name and the age of the person must be accessible by public operations.","label":[[5,12,"entity"],[36,40,"attr"],[46,56,"attr"],[62,66,"attr"],[74,77,"attr"]]}
{"id":289,"text":"25\nIn a university there are different classrooms, offices \nand departments. A department has a name and it \ncontains many offices. A person working at the \nuniversity has a unique ID and can be a professor or \nan employee.\nA professor can be a full, associate or assistant \nprofessor and he\/she is enrolled in one department.\nOffices and classrooms have a number ID, and a \nclassroom has a number of seats.\nEvery employee works in an office.\n","label":[[8,19,"entity"],[39,49,"entity"],[51,59,"entity"],[64,75,"entity"],[79,90,"entity"],[96,101,"attr"],[109,118,"relationship"],[123,130,"entity"],[134,141,"entity"],[141,149,"relationship"],[157,168,"entity"],[181,184,"attr"],[192,195,"relationship"],[197,207,"entity"],[214,222,"entity"],[226,236,"entity"],[240,243,"relationship"],[245,249,"entity"],[251,261,"entity"],[264,274,"entity"],[275,285,"entity"],[299,308,"relationship"],[315,325,"entity"],[327,335,"entity"],[339,350,"entity"],[364,366,"attr"],[375,385,"entity"],[401,406,"attr"],[414,423,"entity"],[423,429,"relationship"],[435,441,"entity"]]}
{"id":291,"text":"17\nThe factory produces several lines of furniture, each with a different name and consisting of several pieces of furniture of different types (beds, tables, chairs, …). All furniture pieces have a type, a single reference (eg CC6578) and a selling price. The major competitive advantage of this innovative plant is the fact that each component produced can be used in more than one piece of furniture. Each piece of furniture is thus composed of several components. The same component can be used more than once in the same piece. Every type of component produced is assigned a unique numerical code, a manufacturing price and a type (screw, hinge, shelf …). The furniture is then sold in various stores throughout the world. Each store has a different address and a fax number. To make the manufacturing process more efficient, stores have to place orders everytime they need to replenish their stock. These orders must also be stored in the database. Each order has a order number, a date, the store that placed the order as well as a list of all the ordered furniture and their quantities.","label":[[32,38,"entity"],[74,79,"attr"],[83,94,"relationship"],[105,112,"entity"],[138,144,"attr"],[185,192,"entity"],[199,203,"attr"],[214,224,"attr"],[250,255,"attr"],[409,415,"entity"],[436,445,"relationship"],[456,466,"entity"],[547,557,"entity"],[597,601,"attr"],[619,625,"attr"],[631,636,"attr"],[699,706,"entity"],[733,739,"entity"],[755,763,"attr"],[769,773,"attr"],[831,838,"entity"],[846,852,"relationship"],[852,859,"entity"],[911,918,"entity"],[931,938,"relationship"],[945,953,"entity"],[960,966,"entity"],[978,984,"attr"],[988,992,"attr"]]}
{"id":292,"text":"8\nIt should be possible to store the national id number (NIN), tax identification number (TIN), name and address for every client. The NIN and TIN must be different for every client and all clients should have at least a TIN and a name. The database should also contain information about the bicycle models that can be rented- Each model has an unique name, a type (that can only be road, mountain, bmx or hybrid) and the number of gears. Each bicycle has a unique identifying number and a model. The company has several different stores where bicycles can be picked up and returned. Each one of these stores is identified by an unique name and has an address (both mandatory). When a reservation is made, the following data must be known: which client did the reservation, when will he pick up the bike (day), which bike model he wants and where will he pick up the bike (store). When a bike is picked up, the actual bike that was picked up must be stored in the database. When a bike is returned, the return date should be stored in the database.","label":[[46,49,"attr"],[63,67,"attr"],[96,101,"attr"],[105,113,"attr"],[123,129,"entity"],[292,300,"entity"],[352,356,"attr"],[360,365,"attr"],[432,437,"attr"],[531,538,"entity"],[636,641,"attr"],[652,660,"attr"],[685,697,"entity"],[746,753,"entity"],[753,757,"relationship"],[761,772,"entity"]]}
{"id":293,"text":"33\nConsider a company with six factories that builds engine components. A single factory takes care of the assembly,\nCustomers place orders, priority customer places orders first with 20% more of the order. Orders are received by the sales department. If the customer places more than ten orders then he has priority. After processing the orders received, the sales department obtains a breakdown of the parts: manufactured parts and subcontracted parts.\nThe sales department can print two types of listings: home listing sent to the factory, and a listing of the subtracted components sent to the stock management department which takes care of the supply of raw materials. The assembly plant then finalizes the order at the final stage. Among the tasks also of the sales department is the follow-up of invoicing.","label":[[31,41,"entity"],[117,127,"entity"],[127,133,"relationship"],[133,139,"entity"],[207,214,"entity"],[218,229,"relationship"],[234,240,"entity"],[459,465,"entity"],[480,486,"relationship"],[509,521,"entity"],[522,527,"relationship"],[534,541,"entity"],[564,574,"entity"],[586,591,"relationship"],[604,615,"entity"]]}
{"id":294,"text":"21\nOr a media library for the borrowing of works by registered customers using a registration form containing their information (name, address, etc.). We have three types of customers, a customer at reduced rates, a customer who subscribes for a year or a customer at a normal rate. All loans have a fixed duration which does not exceed 10 days.\nA customer can borrow different types of work: audio, video or books. These works are recorded in the media library by a unique code. On the other hand, there are documents that the customer cannot borrow, but can only be consulted on site.\nEach book has a particular type, for example the books have a \"novel\" type, or are of the \"detective\" type, etc.\nAfter borrowing a book, the librarian creates a borrowing sheet. This sheet must contain the name of the customer, the date of loan and the date of return. The librarian can add or delete a client or a work.\nThe borrowing of a document by a client follows certain rules:\nThe maximum number of documents to borrow is 5, if it exceeds this number then any new borrowing will be impossible.\nIf the customer who has borrowed a document and who has not returned it, his return deadline will be blocked from making any new loan until he has returned the work, even if the maximum number of borrowing is not reached.","label":[[14,22,"entity"],[30,40,"relationship"],[63,73,"entity"],[174,183,"entity"],[348,357,"entity"],[361,368,"relationship"],[387,391,"entity"],[393,398,"entity"],[400,406,"entity"],[409,414,"entity"],[422,428,"entity"],[432,441,"relationship"],[454,462,"entity"],[592,597,"entity"],[614,618,"attr"]]}
{"id":295,"text":"24\nA company consists of departments. Departments are located in one or more offices. One office acts as a headquarter. Eachdepartment has a manager who is recruited from the set of employees.","label":[[5,13,"entity"],[13,24,"relationship"],[25,36,"entity"],[38,50,"entity"],[54,64,"relationship"],[77,84,"entity"],[90,97,"entity"],[97,104,"relationship"],[107,118,"entity"],[124,134,"entity"],[135,140,"relationship"],[141,149,"entity"],[156,166,"relationship"],[182,191,"entity"]]}
{"id":296,"text":"13\nEach college has its own website. Each college is structured into departments, each of which has specific teachers. Among these teachers, one of them is responsible for the department. A teacher is defined by his name, first name, phone number, e-mail, date of employment and his index. Each teacher teaches only one subject. The students take several subjects and receive a grade for each of them. For each student, we want to manage his name, first name, phone number, e-mail, as well as his year of entry to the college. A subject can be taught by several teachers but always in the same classroom (each one having a certain number of seats). We want to be able to calculate the average per subject and per department. We also want to calculate a student's overall average and display the subjects in which he or she was not graded. Finally, we want to be able to print the data sheet (, first name, phone, e-mail) of a teacher or a student.","label":[[8,16,"entity"],[16,20,"relationship"],[28,35,"entity"],[42,50,"entity"],[53,64,"relationship"],[69,80,"entity"],[96,100,"relationship"],[109,117,"entity"],[131,139,"entity"],[156,168,"relationship"],[176,186,"entity"],[190,198,"entity"],[216,220,"attr"],[222,232,"attr"],[234,240,"attr"],[248,254,"attr"],[256,261,"attr"],[283,288,"attr"],[295,303,"entity"],[303,311,"relationship"],[320,327,"entity"],[333,342,"entity"],[342,347,"relationship"],[355,364,"entity"],[411,418,"entity"],[442,446,"attr"],[448,458,"attr"],[460,466,"attr"],[474,480,"attr"],[497,502,"attr"],[529,537,"entity"],[544,553,"relationship"],[562,571,"entity"]]}
{"id":297,"text":"26\nDesign a system for a movie-shop, in order to\nhandle ordering of movies and browsing of the\ncatalogue of the store, and user subscriptions with\nrechargeable cards.\nOnly subscribers are allowed hiring movies with\ntheir own card.\nCredit is updated on the card during rent\noperations.\nBoth users and subscribers can buy a movie and\ntheir data are saved in the related order.\nWhen a movie is not available it is ordered ","label":[[25,35,"entity"],[172,184,"entity"],[196,203,"relationship"],[203,210,"entity"],[290,296,"entity"],[300,312,"entity"],[316,320,"relationship"],[322,328,"entity"]]}
{"id":298,"text":"6\nWe want to automate the management of a small municipal library. For this, we analyzed its operation to obtain the following list of rules and statements:\nMembers have a first name (character string) and a surname (character string).\nThe library consists of a set of documents and a set of patrons.\nMembers are subscribed or unsubscribed on a simple request.\nNew documents are added to the library regularly.\nThese documents are either journals or volumes.\nVolumes are either dictionaries, books or comics.\nThe documents are characterized by a title (character string).\nVolumes also have an author (character string). Bds also have a recipient name (character string).\nThe newspapers have, in addition to the characteristics of the documents, a date of publication (a date).\nOnly books can be borrowed.\nA member can borrow or return a book.\nMembers can borrow books (and only books) and it must be possible to know at any time which books a member has borrowed.\nA member can borrow a maximum of 3 books.\nThe return date for a borrowed book is fixed at the time of the loan. This date can be extended upon request.","label":[[157,165,"entity"],[172,182,"attr"],[208,216,"attr"],[240,248,"entity"],[248,259,"relationship"],[269,279,"entity"],[292,299,"entity"],[301,309,"entity"],[313,324,"relationship"],[352,359,"entity"],[417,427,"entity"],[427,431,"relationship"],[438,447,"entity"],[450,457,"entity"],[459,467,"entity"],[467,471,"relationship"],[478,490,"entity"],[492,498,"entity"],[501,507,"entity"],[513,523,"entity"],[527,543,"relationship"],[546,552,"attr"],[572,580,"entity"],[593,600,"attr"],[620,624,"entity"],[636,650,"attr"],[675,686,"entity"],[747,751,"attr"],[782,788,"entity"],[807,814,"entity"],[818,825,"relationship"],[837,841,"entity"],[843,851,"entity"],[855,862,"relationship"],[862,868,"entity"],[966,973,"entity"]]}
{"id":299,"text":"7\nATMs are deceptively simple: although customers only need to press a few buttons to receive cash, there are many layers of security that a safe and effective ATM must pass through to prevent fraud and provide value for banking customers. The various human and inanimate parts of an ATM system are illustrated by this easy-to-read diagram—every class has its title, and the attributes are listed beneath. You can edit, save, and share this chart by opening the document and signing up for a free Lucidchart account.","label":[[2,7,"entity"],[40,50,"entity"]]}
{"id":300,"text":"16\nEach customer has a VAT number, a name, a phone number and an address. There are no two clients with the same VAT number. When a customer wants to send a package to another customer, he just has to login to the company website, select the customer he wants to send the package to, enter the package’s weight and if the delivery is normal or urgent. He then receives an unique identifier code that he writes on the package. The package is then delivered by the customer at the delivery center of his choosing. A delivery center has a unique name and an address. Each client has an associated delivery center. This delivery center is chosen by the company and it is normally the one closest to the customer’s house. The package is them routed through an internal system until it reaches the delivery center of the recipient. The package is then delivered by hand from that delivery center to the recipient by a courier. Couriers have a single VAT number, a name and a phone number. Each courier works in a single delivery center. A courier is assigned to a packet as soon as the packet is introduced in the system.","label":[[8,16,"entity"],[23,33,"attr"],[37,41,"attr"],[45,57,"attr"],[65,72,"attr"],[132,140,"entity"],[150,154,"relationship"],[157,164,"entity"],[176,184,"entity"],[272,279,"entity"],[294,301,"entity"],[304,310,"attr"],[344,350,"attr"],[379,389,"attr"],[430,437,"entity"],[446,458,"relationship"],[463,471,"entity"],[479,494,"entity"],[514,529,"entity"],[543,547,"attr"],[555,562,"attr"],[569,575,"entity"],[583,594,"relationship"],[594,609,"entity"],[830,837,"entity"],[846,858,"relationship"],[912,919,"entity"],[921,929,"entity"],[944,954,"attr"],[958,963,"attr"],[969,981,"attr"],[988,995,"entity"],[996,1004,"relationship"],[1014,1029,"entity"],[1033,1040,"entity"],[1041,1052,"relationship"],[1058,1064,"entity"]]}
{"id":301,"text":"35\nConsider a document made up of one or more sheets. The sheet includes geo objects and text. Graphical objects support type operations: select, copy, cut, paste and move. We assume the following two geometric objects: circle and rectangle.","label":[[14,22,"entity"],[23,33,"relationship"],[46,52,"entity"],[58,63,"entity"],[64,72,"relationship"],[73,84,"entity"],[89,93,"entity"],[95,112,"entity"],[201,218,"entity"],[220,227,"entity"],[231,240,"entity"]]}
{"id":302,"text":"5\nAnyone who has carried out a professional activity for 5 years related to the subject of their application may apply for a technological and vocational education diploma from the Center for Validation of Acquired Skills of the Academy of their place of residence. .\n\nThe employee obtains a blank file from the Academy's Acquired Validation Center (CAVA). After completing the file, the employee sends it to the CAVA. The file contains the civil status of the candidate (surname, first name, address), a description of his professional activities for 5 years, the diploma requested. The files are registered in the CAVA database (a reference number is automatically assigned to them).\n\nThe CAVA sends the file to the home of the Academy inspector responsible for the diploma concerned. The inspector verifies whether the file is admissible. That is to say, if the diploma requested corresponds to the professional activities of the candidate for at least 5 years. The inspector communicates his decision to the CAVA, which records it in its database. If the file is admissible, an acknowledgment of receipt is sent to the candidate; otherwise the file is returned to the candidate with a letter indicating the reasons for the refusal of the file.\n\nThere is one jury per diploma. A jury is made up of the Academy inspector responsible for the diploma and teachers. The CAVA knows the contact details of the teachers who are members of a jury. Each jury meets three times a year.\n\nThe schedule of jury meetings is established by the Academy inspector responsible for the diploma concerned, at the start of the school year. Three weeks before a meeting of a jury, the CAVA summons the members of the jury as well as the candidates with a pending diploma application file (concerning the diploma under the responsibility of the jury).\n\nAt the end of a meeting, the jury draws up minutes in which the decisions of the jury are summarized (acceptance or refusal of the diploma). Depending on this report, the CAVA sends a certificate of diploma to the candidates or a refusal of diploma.","label":[[164,171,"entity"],[273,282,"entity"],[388,397,"entity"],[472,479,"attr"],[480,491,"attr"],[493,500,"attr"],[524,547,"attr"],[565,582,"entity"],[633,649,"attr"],[738,747,"entity"],[768,775,"entity"],[791,800,"entity"],[865,873,"entity"],[933,943,"entity"],[969,979,"entity"],[1123,1132,"entity"],[1172,1182,"entity"],[1262,1267,"entity"],[1271,1278,"entity"],[1313,1323,"entity"],[1323,1338,"relationship"],[1343,1351,"entity"],[1355,1363,"entity"],[1407,1416,"entity"],[1424,1434,"relationship"],[1437,1441,"entity"],[1448,1453,"entity"],[1496,1501,"entity"],[1570,1578,"entity"]]}
{"id":303,"text":"34\neach type of product has a unique code (barcode label), and the same price for all products of this type. the objective is to facilitate the maintenance of the prices of the articles.\neach type of product is referenced in a catalog, with its associated price. When the price of a product must be modified, the manager modifies its price in the catalog, then on the floor where it is stored.\nThe cashier identifies himself to start the cash register (with a password).\nthe cash register will carry out the usual functions of a cash register: subtotal calculation, total calculation, possibility of entering several items with the same code, return of goods with the receipt. Payment will be in cash only.\nThe cash register allows you to edit reports:\n· the receipt which will be given only for an effective sale . it contains the store name, a welcome message, the date and time. Then for each sale it gives the product code, product description, unit price, quantity and subtotal. Finally we find the total including VAT\n· The detailed daily report: list of the detailed set of sales for the day.","label":[[16,24,"entity"],[30,41,"attr"],[43,51,"attr"],[72,78,"attr"],[86,94,"entity"],[313,320,"entity"],[398,405,"entity"],[428,433,"relationship"],[438,451,"entity"],[475,488,"entity"],[711,724,"entity"],[759,766,"entity"],[832,842,"attr"],[846,861,"attr"],[867,872,"attr"],[876,880,"attr"],[896,901,"entity"],[914,926,"attr"],[928,947,"attr"],[949,959,"attr"],[961,970,"attr"],[974,982,"attr"],[1004,1010,"entity"],[1020,1023,"entity"]]}
{"id":304,"text":"42\nYou are asked to create a database to store cooking recipes and also to manage the stocks of ingredients you have. Each recipe has a name, a description, the preparation and cooking time, the number of calories per person, the number of parts and the level of difficulty: difficult, medium or easy. For each recipe you want to know what ingredients are needed and the quantity associated with each ingredient. For each ingredient you have its name and the number of calories per 100 grams of that ingredient. Each ingredient has a type, for example starch for the ingredient potato. The same ingredient can have several packaging, for example, the ingredient flour can be stored as a 1 kg or 500 g package. These two packages will be considered as different products. To manage the stocks of ingredients, the storage location of the products in the housing is memorized. Each storage is named and for each storage you know which products are stored there. The same ingredient can be stored in several racks.","label":[[55,62,"entity"],[96,108,"entity"],[123,129,"entity"],[136,140,"attr"],[144,155,"attr"],[161,173,"attr"],[177,189,"attr"],[195,213,"attr"],[230,245,"attr"],[263,273,"attr"],[311,318,"entity"],[340,352,"entity"],[371,379,"attr"],[401,411,"entity"],[422,433,"entity"],[446,451,"attr"],[459,477,"attr"],[500,510,"entity"],[517,528,"entity"],[528,532,"relationship"],[534,538,"entity"],[595,606,"entity"],[610,615,"relationship"],[623,632,"entity"],[720,729,"entity"],[737,751,"relationship"],[761,769,"entity"],[795,806,"entity"],[812,820,"entity"],[829,832,"relationship"],[836,845,"entity"],[879,887,"entity"],[890,896,"attr"],[909,917,"entity"],[932,941,"entity"],[945,951,"relationship"],[1004,1009,"attr"]]}
{"id":305,"text":"28\nA bank system contains data on customers \n(identified by name and address) and \ntheir accounts.\nEach account has a balance and there are 2 \ntype of accounts: one for savings which \noffers an interest rate, the other for \ninvestments, used to buy stocks.\nStocks are bought at a certain quantity for \na certain price (ticker) and the bank \napplies commission on stock orders.","label":[[34,44,"entity"],[46,59,"relationship"],[60,65,"attr"],[69,76,"attr"],[89,97,"entity"],[104,112,"entity"],[118,125,"attr"],[151,159,"entity"],[169,176,"entity"],[194,207,"attr"],[224,235,"entity"],[237,248,"relationship"],[249,255,"entity"],[257,264,"entity"],[288,297,"attr"],[319,325,"attr"],[341,348,"relationship"],[349,360,"attr"],[363,375,"entity"]]}
{"id":306,"text":"36\nConsider an information system that concerns the monitoring of the personnel of a set of local agencies. Each agency is located in a region, each region is managed by a regional management. The regional management is in charge of a set of local agencies.\na regional directorate is characterized by a code and a wording.","label":[[70,79,"entity"],[98,106,"entity"],[113,119,"entity"],[123,133,"relationship"],[136,142,"entity"],[149,155,"entity"],[159,169,"relationship"],[172,191,"entity"],[197,216,"entity"],[220,232,"relationship"],[248,256,"entity"],[260,269,"entity"],[303,308,"attr"],[314,321,"attr"]]}
{"id":307,"text":"27\nWe want to model a system for management of flights and pilots.\nAn airline operates flights. Each airline has an ID.\nEach flight has an ID a departure airport and an arrival airport: an \nairport as a unique identifier.\nEach flight has a pilot and a co-pilot, and it uses an aircraft of a \ncertain type; a flight has also a departure time and an arrival time. \nAn airline owns a set of aircrafts of different types. \nAn aircraft can be in a working state or it can be under repair. \nIn a particular moment an aircraft can be landed or airborne. \nA company has a set of pilots: each pilot has an experience level:\n1 is minimum, 3 is maximum.\nA type of aeroplane may need a particular number of pilots, with a \ndifferent role (e.g.: captain, co-pilot, navigator): there must be at least \none captain and one co-pilot, and a captain must have a level 3.","label":[[47,54,"entity"],[59,65,"entity"],[70,77,"entity"],[78,86,"relationship"],[87,94,"entity"],[101,108,"entity"],[116,118,"attr"],[125,131,"entity"],[132,136,"relationship"],[139,141,"attr"],[144,161,"entity"],[169,184,"entity"],[190,198,"entity"],[210,220,"attr"],[227,234,"entity"],[234,238,"relationship"],[240,246,"entity"],[269,274,"relationship"],[277,286,"entity"],[308,315,"entity"],[326,340,"attr"],[348,360,"attr"],[366,373,"entity"],[374,378,"relationship"],[388,397,"entity"],[422,430,"entity"],[476,482,"attr"],[511,519,"entity"],[527,533,"attr"],[571,577,"entity"]]}
{"id":308,"text":"39\nA hotel is composed of at least two rooms. Each room has a bathroom: shower or bath. A hotel accommodates people. It can employ staff and it must be managed by a manager. Only the first and last names of the employees, managers and occupants are known. Some people are children and others are adults (it is forbidden to employ children). A hotel has the following characteristics: an address, a number of rooms and a category. A room is characterized by the number and beds it contains, its price and its number. We want to know who occupies which room on which date. For each day of the year, we want to be able to calculate the rent of each room according to its price and its occupation (the rent is null if the room is unoccupied). The sum of these rents allows to calculate the turnover of the hotel between two dates.","label":[[5,11,"entity"],[14,25,"relationship"],[39,44,"entity"],[51,56,"entity"],[56,59,"relationship"],[62,70,"entity"],[72,79,"entity"],[82,86,"entity"],[90,96,"entity"],[124,131,"relationship"],[131,137,"entity"],[152,162,"relationship"],[165,172,"entity"],[183,188,"attr"],[193,203,"attr"],[211,220,"entity"],[222,231,"entity"],[235,245,"entity"],[261,268,"entity"],[343,348,"entity"],[387,394,"attr"],[398,413,"attr"],[420,428,"attr"],[432,436,"entity"],[461,468,"attr"],[472,476,"attr"],[494,500,"attr"],[508,514,"attr"]]}
{"id":309,"text":"41\nA company has several warehouses located in different cities. In each of the warehouses is stored merchandise, the different products it needs for its activity. Two different warehouses can have the same products. For each product we also want to know its supplier (name, address), its name, whether it is toxic or not and what volume it occupies. For each warehouse we want to know its surface and its address.","label":[[5,13,"entity"],[13,16,"relationship"],[25,36,"entity"],[36,46,"relationship"],[57,63,"entity"],[80,91,"entity"],[94,101,"relationship"],[101,112,"entity"],[128,137,"entity"],[178,189,"entity"],[207,215,"entity"],[226,234,"entity"],[255,258,"relationship"],[259,268,"entity"],[269,273,"attr"],[275,282,"attr"],[289,293,"attr"],[309,315,"attr"],[331,338,"attr"],[360,370,"entity"],[390,398,"attr"],[406,413,"attr"]]}
{"id":310,"text":"29\nAirlines offer different flights\nA flight is open for booking and closed by order of the company\nA customer can book one or more flights, for different passengers\nA reservation concerns a single flight and a single passenger\nA reservation can be confirmed or canceled\nA flight has a departure airport and an arrival airport\nA flight has a day and time of departure, and a day and time of arrival\nA flight may include stopovers in one or more airport(s)\nA stopover has a departure time and an arrival time\nEach airport serves one or more cities","label":[[3,12,"entity"],[12,17,"relationship"],[28,35,"entity"],[38,45,"entity"],[48,56,"relationship"],[57,65,"entity"],[102,110,"entity"],[115,120,"relationship"],[132,139,"entity"],[155,165,"entity"],[168,179,"entity"],[180,189,"relationship"],[198,204,"entity"],[218,227,"entity"],[230,242,"entity"],[273,280,"entity"],[280,284,"relationship"],[296,304,"entity"],[329,336,"entity"],[342,367,"attr"],[375,398,"attr"],[401,408,"entity"],[412,419,"relationship"],[420,430,"entity"],[458,467,"entity"],[473,487,"attr"],[495,507,"attr"],[513,521,"entity"],[521,527,"relationship"],[540,546,"entity"]]}
{"id":311,"text":"22\nThe popular bank in Morocco contains several agencies, it is characterized by its name (popular bank) and directed by a director, has a capital and an address. THE director of the bank has a name, first name, age and salary (or income). Each agency has an address, employees and an identifier. Each employee also has a surname, first name and date of hire. An employee only works in one agency, but can request a transfer to another agency. An employee can manage one or more customers, the latter has a single account in a given agency, a name, first name and an address. Each registered customer is assigned to an employee in the agency.\nAn account can either be a paid or unpaid account. Interest-bearing accounts have an interest rate paid annually","label":[[15,20,"entity"],[31,40,"relationship"],[48,56,"entity"],[85,90,"attr"],[109,120,"relationship"],[123,131,"entity"],[139,147,"attr"],[154,161,"attr"],[167,176,"entity"],[194,198,"attr"],[200,210,"attr"],[212,216,"attr"],[220,227,"attr"],[245,252,"entity"],[252,256,"relationship"],[259,266,"attr"],[268,277,"entity"],[285,295,"attr"],[302,310,"entity"],[322,329,"attr"],[331,341,"attr"],[346,358,"attr"],[363,372,"entity"],[377,383,"relationship"],[390,396,"entity"],[436,442,"entity"],[447,456,"entity"],[460,466,"relationship"],[479,488,"entity"],[501,504,"relationship"],[514,522,"entity"],[522,524,"relationship"],[533,539,"entity"],[543,547,"attr"],[549,559,"attr"],[567,574,"attr"],[592,601,"entity"],[604,613,"relationship"],[619,628,"entity"],[628,630,"relationship"],[635,641,"entity"],[646,654,"entity"]]}
{"id":312,"text":"10\nModel a LAN in which we find two kinds of printers: ASCII printers can only print ASCII documents. PostScript printers can print either ASCII or Postscript documents. The documents are sent around as content of packets.","label":[[45,53,"entity"],[61,70,"entity"],[79,85,"relationship"],[91,100,"entity"],[113,122,"entity"],[126,132,"relationship"],[159,168,"entity"],[174,184,"entity"],[188,202,"relationship"],[214,221,"entity"]]}
{"id":313,"text":"14\nFor each admitted animal, its name, breed (if any) and owner must be stored. Each animal should be given an unique numeric identifier. For each owner, its name, address and phone number should be stored. An unique numeric identifier should also be generated for each one of them. An animal might be owner-less. This happens frequently as the clinic often rescues abandoned dogs from the streets in order to treat them and get them new owners. It should be possible to store information about a specific breed even if no animals of that breed have been treated at the clinic. Each appointement always has a responsible physician. All appointements start at a certain date and time; and are attended by an animal (and of course its owner). For each physician, his name, address and phone number should be stored. An unique numeric identifier should also be generated for each one of them. In an appointement, several medical conditions might be detected. Each condition has a common name and a scientific name. No two conditions have the same scientific name. It should be possible to store information about the most common conditions for each different breed in the database.","label":[[21,27,"entity"],[28,32,"relationship"],[33,37,"attr"],[39,45,"attr"],[58,64,"entity"],[85,92,"entity"],[126,136,"attr"],[147,152,"entity"],[158,162,"attr"],[164,171,"attr"],[176,188,"attr"],[225,236,"attr"],[286,293,"entity"],[438,444,"entity"],[506,512,"entity"],[523,531,"entity"],[583,596,"entity"],[603,607,"relationship"],[621,630,"entity"],[636,650,"entity"],[669,674,"attr"],[678,682,"attr"],[692,703,"relationship"],[707,714,"entity"],[733,738,"entity"],[750,759,"entity"],[765,769,"attr"],[771,779,"attr"],[783,796,"attr"],[832,843,"attr"],[896,908,"entity"],[926,937,"entity"],[946,954,"relationship"],[961,971,"entity"],[977,988,"attr"],[995,1010,"attr"]]}
{"id":314,"text":"40\nLet the following sentences apply: A directory contains files. A room contains walls. Modems and keyboards are input\/output devices. A stock exchange transaction is a purchase or a sale. A bank account can belong to a natural or legal person","label":[[40,49,"entity"],[50,59,"relationship"],[59,64,"entity"],[68,72,"entity"],[73,82,"relationship"],[82,87,"entity"],[89,96,"entity"],[100,110,"entity"],[127,134,"entity"],[138,164,"entity"],[170,178,"entity"],[184,188,"entity"],[192,204,"entity"],[209,218,"relationship"],[238,244,"entity"]]}
{"id":315,"text":"32\nEach hotel contains a number of rooms, each room is rented by a fixed price. The manager of the hotel manages the rental of the rooms.\nAccess to the bathrooms is free since it is included in the price of the rooms. Some rooms do not have a bathroom. The other rooms, such as kitchen, reception hall, are not part of the study. People can rent one or more rooms in the hotel. In other words: the hotel accommodates a certain number of people.\nThe reservation of a room is made by a customer, the manager looks for a free room, if there is the manager gives the price of the room to the customer who becomes the tenant of the room after having paid. Otherwise, the customer leaves.","label":[[8,14,"entity"],[14,22,"relationship"],[35,40,"entity"],[47,51,"entity"],[73,78,"attr"],[84,91,"entity"],[99,104,"entity"],[105,112,"relationship"],[131,136,"entity"],[152,161,"entity"],[198,203,"attr"],[211,216,"entity"],[223,228,"entity"],[243,251,"entity"],[263,268,"entity"],[330,336,"entity"],[341,345,"relationship"],[358,363,"entity"],[371,376,"entity"],[398,403,"entity"],[404,416,"relationship"],[437,443,"entity"],[449,460,"relationship"],[466,470,"entity"],[484,491,"entity"],[498,505,"entity"],[523,527,"entity"],[545,552,"entity"],[563,568,"attr"],[576,580,"entity"],[588,596,"entity"],[627,631,"entity"],[666,674,"entity"]]}
{"id":317,"text":"38\nEvery day, the mailman delivers registered mail in a geographical area assigned to him. The inhabitants are also associated with a geographical area. There are two types of registered mail: letters and parcels. As several letter carriers can intervene in the same area, we want, for each registered letter, the letter carrier who delivered it, in addition to the addressee.","label":[[18,25,"entity"],[26,34,"relationship"],[46,50,"entity"],[56,73,"entity"],[74,83,"relationship"],[95,106,"entity"],[116,126,"relationship"],[134,151,"entity"],[193,200,"entity"],[205,212,"entity"],[302,308,"entity"],[366,374,"attr"]]}
{"id":318,"text":"15\nEach ingredient has a name, a measuring unit (e.g. olive oil is measured in liters, while eggs are unit based) and a quantity in stock. There are no two ingredients with the same name.\nEach dish is composed of several ingredients in a certain quantity. An ingredient can, of course, be used in different dishes. A dish has an unique name and a numeric identifier. There are several tables at the restaurant. Each one of them has an unique numeric identifier and a maximum ammount of people that can be seated there. In each meal, several dishes are consumed at a certain table. The same dish can be eaten more than once in the same meal. A meal takes place in a certain date and has a start and end time. Each meal has a responsible waiter. A waiter has an unique numerical identifier, a name, an address and a phone number. In some cases it is important to store information about the client that consumed the meal. A client has a tax identification number, a name and an address.","label":[[8,18,"entity"],[25,29,"attr"],[33,47,"attr"],[120,128,"attr"],[156,167,"entity"],[193,197,"entity"],[201,209,"relationship"],[221,232,"entity"],[259,269,"entity"],[289,293,"relationship"],[307,313,"entity"],[317,321,"entity"],[336,340,"attr"],[355,365,"attr"],[385,391,"entity"],[449,460,"attr"],[486,492,"attr"],[527,531,"entity"],[541,547,"entity"],[552,560,"relationship"],[574,579,"entity"],[590,594,"entity"],[602,607,"relationship"],[635,639,"entity"],[643,647,"entity"],[673,677,"attr"],[688,693,"attr"],[698,706,"attr"],[713,717,"entity"],[724,735,"relationship"],[736,742,"entity"],[746,752,"entity"],[777,787,"attr"],[791,795,"attr"],[800,807,"attr"],[814,826,"attr"],[889,895,"entity"],[901,909,"relationship"],[914,918,"entity"],[922,928,"entity"],[935,953,"attr"],[964,968,"attr"],[976,983,"attr"]]}
{"id":319,"text":"12\nA national company selling household appliances wishes to carry out a first object analysis experiment with the UML method on a small subset of its IS. This subset concerns the follow-up of the personnel of the local agencies located in the regions. Each region is managed by a regional department which is in charge of a certain number of local agencies. A regional management is characterized by a code and a label. ","label":[[197,206,"entity"],[214,228,"entity"],[258,264,"entity"],[268,275,"relationship"],[281,300,"entity"],[313,319,"relationship"],[343,357,"entity"],[361,380,"entity"],[403,407,"attr"],[414,419,"attr"]]}
{"id":320,"text":"18\nA factory has several machines. Each one of them is operated by several workers. A worker might work in more than one machine. In this factory, several products of different types, are produced. Each different type of product is produced in a single machine. But, the same machine can produce more than one type of product. Products from the same type are all produced from the same single material and have the same weigth. Clients can issue purchase orders. Each order has a list of the desired products and their quantity. For each worker, the following data should be stored in the database: name (first and last), birth date, address and a list of his skills. For each machine, the following data should be stored: serial number, make, model and purchase date. For each client, the followig data should be stored: name, address, phone number and name of the contact person (if any). For each purchase order, the following date should be stored: order number, date it has been made, expected and actual delivery date.","label":[[5,12,"entity"],[13,16,"relationship"],[25,33,"entity"],[55,63,"relationship"],[75,82,"entity"],[86,92,"entity"],[99,103,"relationship"],[121,128,"entity"],[138,145,"entity"],[155,163,"entity"],[221,228,"entity"],[253,260,"entity"],[276,283,"entity"],[288,295,"relationship"],[318,325,"entity"],[327,335,"entity"],[393,401,"attr"],[419,426,"attr"],[428,435,"entity"],[446,454,"relationship"],[455,461,"entity"],[468,473,"entity"],[492,508,"attr"],[519,527,"attr"],[538,544,"entity"],[599,603,"attr"],[621,632,"attr"],[633,641,"attr"],[660,666,"attr"],[677,684,"entity"],[723,729,"attr"],[738,742,"attr"],[744,749,"attr"],[754,767,"attr"],[778,784,"entity"],[822,826,"attr"],[828,835,"attr"],[837,849,"attr"],[866,880,"attr"],[959,965,"attr"],[967,971,"attr"],[1003,1018,"attr"]]}
{"id":321,"text":"4\nTo facilitate its management, a storage warehouse plans to computerize. The software to be produced must automatically allocate a location for the loading of the trucks that convey the stock to be stored.\n\nThe operation of the computer system must be as follows:\n\nunloading a truck: when a truck arrives, an employee must enter the characteristics of each item into the system; the system then produces a list with a location for each item;\nloading a truck: the characteristics of the items to be loaded into a truck are entered by an employee in order to indicate to the system to free up slots.\nLoading and unloading is done manually.\n\nWarehouse employees are under the responsibility of a manager whose role is to supervise the proper application of the instructions.","label":[[266,276,"entity"],[310,319,"entity"],[358,363,"entity"],[437,441,"entity"],[487,493,"entity"],[537,546,"entity"],[592,597,"entity"],[640,650,"entity"],[650,660,"entity"],[664,691,"relationship"],[694,702,"entity"],[719,728,"relationship"],[759,771,"entity"]]}
{"id":322,"text":"43\nCinemas are composed of several rooms. Films are shown in theaters. The corresponding screenings take place at a specific time each.","label":[[3,10,"entity"],[15,23,"relationship"],[35,40,"entity"],[42,47,"entity"],[52,57,"relationship"],[61,69,"entity"]]}
{"id":323,"text":"44\nA house may have any number of pets living in it. The two possible types of pets that can live in a house are dogs and cats. Each dog or cat has a name. An animal’s house is its one and only home. You can ell an animal to make noise and it will do its thing.","label":[[5,10,"entity"],[34,38,"attr"],[79,83,"entity"],[93,97,"relationship"],[103,108,"entity"],[113,117,"entity"],[122,126,"entity"],[133,136,"entity"],[140,143,"entity"],[150,154,"attr"]]}
{"id":324,"text":"23\nA real estate agency lists a number of properties of different types for sale. Properties that gets sold\nare removed from the list, and new ones can be added. The maximum number of properties the\nagency can handle at a given time is 100.\nAll property entries show the property area in m2\n, number of rooms, neighborhood name, and price.\nDescription of each of the types of listed properties include:\nVilla: has a swimming pool or not, and number of adjacent streets\nApartment: on which floor? and is there a parking lot?\nFurnished apartment: furniture quality on a scale 1(best) to 5\n","label":[[17,23,"entity"],[199,205,"entity"],[245,253,"entity"],[280,284,"attr"],[303,308,"attr"],[310,327,"attr"],[333,338,"attr"],[383,393,"entity"],[393,401,"relationship"],[403,408,"entity"],[416,429,"attr"],[452,468,"attr"],[469,478,"entity"],[489,494,"attr"],[511,518,"attr"],[524,543,"entity"],[545,562,"attr"]]}
{"id":325,"text":"31\nA company offers several trains.\nA train is closed or open for reservation.\nA customer can book one or more trains.\nEach reservation concerns a single passenger and a single train.\nTwo states for a reservation: either canceled or confirmed.\nA train has an arrival station or a departure station.\nA train has a departure day, a departure time, and an arrival time.\nA train may include stops at stations.\nA stop has a departure time and an arrival time.\nEach station organizes trips to one or more cities.\nA station has a name, organizes trips to several cities.\na station has a name.\na customer or passenger has a surname, first name, address and telephone number.\na company has a name.\na stop and linked to a departure time and an arrival time.\na city has a name.\na train has an identifier, a departure and arrival date, a departure and arrival time.","label":[[5,12,"entity"],[13,19,"relationship"],[28,34,"entity"],[38,43,"entity"],[47,53,"relationship"],[57,61,"relationship"],[66,77,"entity"],[81,89,"entity"],[111,117,"entity"],[124,135,"entity"],[136,144,"relationship"],[154,163,"entity"],[177,182,"entity"],[201,212,"entity"],[246,251,"entity"],[252,255,"relationship"],[259,274,"entity"],[280,297,"entity"],[301,306,"entity"],[313,326,"attr"],[330,344,"attr"],[353,365,"attr"],[369,374,"entity"],[379,386,"relationship"],[387,392,"entity"],[408,412,"entity"],[419,433,"attr"],[441,453,"attr"],[460,467,"entity"],[468,477,"relationship"],[499,505,"entity"],[509,516,"entity"],[523,527,"attr"],[566,573,"entity"],[580,584,"attr"],[588,596,"entity"],[600,609,"entity"],[616,623,"attr"],[625,635,"attr"],[637,644,"attr"],[649,665,"attr"],[669,676,"entity"],[683,687,"attr"],[691,695,"entity"],[712,726,"attr"],[734,746,"attr"],[750,754,"entity"],[761,765,"attr"],[769,774,"entity"],[782,792,"attr"],[796,805,"attr"],[810,822,"attr"]]}
{"id":326,"text":"19\nAn employee takes care of registering the loans of members who want to borrow the CD-ROMs. The employee must first authenticate to perform this operation. Each cd borrowed must be returned to the library employee after a period of 3 days. The member can therefore reserve CD-ROMs containing games, each reservation must mention the borrower, the game and the date of reservation. The member is notified when the game (cd) returns to the shelves.\nThe employee can also organize events, to do so he must provide the following information: the minimum and maximum number of participants, the games to be tested, the date of the event and the start time of the event.\nThe member who wishes to participate in an event can register provided that there is still space available. To do so, he must enter a password and login.\nIf the member finds an available place then he can pay his subscription online by an external payment system.","label":[[6,14,"entity"],[29,40,"relationship"],[54,61,"entity"],[74,80,"relationship"],[85,92,"entity"],[98,106,"entity"],[246,252,"entity"],[267,274,"relationship"],[275,282,"entity"],[294,299,"attr"],[306,317,"entity"],[334,343,"attr"],[349,353,"attr"],[362,367,"attr"],[370,381,"entity"],[387,393,"entity"],[453,461,"entity"],[471,479,"relationship"],[480,486,"entity"],[592,597,"entity"],[604,610,"relationship"],[616,620,"attr"],[642,652,"attr"],[671,677,"entity"],[692,703,"relationship"],[710,715,"entity"],[828,834,"entity"],[872,875,"relationship"],[880,892,"entity"]]}
{"id":327,"text":"9\nA token-ring based local-area-network (LAN) is a network consisting of nodes, in which network packets are sent around. Every node has a unique name within the network, and refers to its next node. Different kinds of nodes exist: workstations are originators of messages; servers and printers are network nodes that can receive messages. Packets contain an originator, a destination and content, and are sent around on a network. A LAN is a circular configuration of nodes.","label":[[41,44,"entity"],[73,78,"entity"],[97,105,"entity"],[128,133,"entity"],[146,151,"attr"],[162,169,"entity"],[189,194,"relationship"],[194,198,"entity"],[232,245,"entity"],[274,282,"entity"],[286,295,"entity"],[340,348,"entity"],[359,369,"attr"],[373,385,"attr"],[389,396,"attr"],[406,420,"relationship"],[423,430,"entity"],[434,438,"entity"],[438,468,"relationship"],[469,474,"entity"]]}
{"id":328,"text":"11\nEach document is composed of one or more sheets. A sheet contains text and geometrical objects which constitute two types of graphic objects supporting operations such as: select, copy, cut, paste and move. \nWe consider the following four geometric objects: circle, ellipse, square, rectangle. We are asked to use the properties of generalization and specialization in order to represent these geometric objects in the best possible way. ","label":[[8,17,"entity"],[20,29,"relationship"],[44,50,"entity"],[54,60,"entity"],[60,69,"relationship"],[69,74,"entity"],[78,97,"entity"],[261,267,"entity"],[269,276,"entity"],[278,284,"entity"],[286,295,"entity"]]}
